spec/fixtures/responses/external_sales_invoice.json

{
	"id": "283632324719936675",
	"administration_id": "123",
	"contact_id": "283632858001573281",
	"contact": {
		"id": "283632858001573281",
		"administration_id": "123",
		"company_name": "Foobar Holding B.V.",
		"firstname": "",
		"lastname": "",
		"address1": "Hoofdstraat 12",
		"address2": "",
		"zipcode": "1234AB",
		"city": "Amsterdam",
		"country": "",
		"phone": "",
		"delivery_method": "Email",
		"customer_id": "153",
		"tax_number": "",
		"chamber_of_commerce": "",
		"bank_account": "",
		"attention": "",
		"email": "email@example.org",
		"email_ubl": false,
		"send_invoices_to_attention": "",
		"send_invoices_to_email": "",
		"send_estimates_to_attention": "",
		"send_estimates_to_email": "",
		"sepa_active": false,
		"sepa_iban": "",
		"sepa_iban_account_name": "",
		"sepa_bic": "",
		"sepa_mandate_id": "",
		"sepa_mandate_date": null,
		"sepa_sequence_type": "RCUR",
		"credit_card_number": "",
		"credit_card_reference": "",
		"credit_card_type": null,
		"tax_number_validated_at": null,
		"tax_number_valid": null,
		"invoice_workflow_id": null,
		"estimate_workflow_id": null,
		"si_identifier": "",
		"si_identifier_type": null,
		"created_at": "2020-03-20T14:09:53.685Z",
		"updated_at": "2020-03-20T14:09:53.685Z",
		"version": 1584713393,
		"sales_invoices_url": "https://moneybird.dev/123/sales_invoices/4f80c2852975ea43d7ccc069478c950a6aa4386d97641c854115d72e611a26c4/all",
		"notes": [],
		"custom_fields": []
	},
	"date": "2020-03-19",
	"state": "open",
	"due_date": null,
	"reference": "1166",
	"entry_number": 4,
	"origin": "upload",
	"source": "",
	"source_url": "",
	"currency": "EUR",
	"paid_at": null,
	"created_at": "2020-03-20T14:01:25.100Z",
	"updated_at": "2020-03-22T07:55:27.150Z",
	"version": 1584863727,
	"details": [{
		"id": "283632981234419418",
		"administration_id": "123",
		"tax_rate_id": "188988632947754057",
		"ledger_account_id": "188988632285054954",
		"project_id": "272837143794025774",
		"product_id": null,
		"amount": "1 x",
		"amount_decimal": "1.0",
		"description": "Product",
		"price": "27.5",
		"period": null,
		"row_order": 0,
		"total_price_excl_tax_with_discount": "22.73",
		"total_price_excl_tax_with_discount_base": "22.73",
		"tax_report_reference": ["NL/1a"],
		"created_at": "2020-03-20T14:11:51.208Z",
		"updated_at": "2020-03-20T14:11:51.208Z"
	}, {
		"id": "283632981241759451",
		"administration_id": "123",
		"tax_rate_id": "188988632947754057",
		"ledger_account_id": "188988632285054954",
		"project_id": "272837143794025774",
		"product_id": null,
		"amount": "1 x",
		"amount_decimal": "1.0",
		"description": "Korting",
		"price": "-27.5",
		"period": null,
		"row_order": 1,
		"total_price_excl_tax_with_discount": "-22.73",
		"total_price_excl_tax_with_discount_base": "-22.73",
		"tax_report_reference": ["NL/1a"],
		"created_at": "2020-03-20T14:11:51.215Z",
		"updated_at": "2020-03-20T14:11:51.215Z"
	}],
	"payments": [],
	"total_paid": "0.0",
	"total_unpaid": "0.0",
	"total_unpaid_base": "0.0",
	"prices_are_incl_tax": true,
	"total_price_excl_tax": "0.0",
	"total_price_excl_tax_base": "0.0",
	"total_price_incl_tax": "0.0",
	"total_price_incl_tax_base": "0.0",
	"notes": [],
	"attachments": [],
	"events": [{
		"administration_id": "123",
		"user_id": "188931287062414531",
		"action": "external_sales_invoice_updated",
		"link_entity_id": null,
		"link_entity_type": null,
		"data": {},
		"created_at": "2020-03-22T07:55:27.154Z",
		"updated_at": "2020-03-22T07:55:27.154Z"
	}, {
		"administration_id": "123",
		"user_id": "188931287062414531",
		"action": "external_sales_invoice_updated",
		"link_entity_id": null,
		"link_entity_type": null,
		"data": {},
		"created_at": "2020-03-20T14:11:51.224Z",
		"updated_at": "2020-03-20T14:11:51.224Z"
	}, {
		"administration_id": "123",
		"user_id": "188931287062414531",
		"action": "external_sales_invoice_updated",
		"link_entity_id": null,
		"link_entity_type": null,
		"data": {},
		"created_at": "2020-03-20T14:09:53.844Z",
		"updated_at": "2020-03-20T14:09:53.844Z"
	}, {
		"administration_id": "123",
		"user_id": "188931287062414531",
		"action": "external_sales_invoice_created",
		"link_entity_id": null,
		"link_entity_type": null,
		"data": {},
		"created_at": "2020-03-20T14:01:25.167Z",
		"updated_at": "2020-03-20T14:01:25.167Z"
	}],
	"tax_totals": []
}